app/views/comments/_comment.html.erb

INSERT INTO `comments` (`user_id`, `body`, `commentable_type`, `commentable_id`, `created_at`, `updated_at`) VALUES (2, 'あｓｄｆ', 'Recipe', 1, '2024-07-28 02:10:16.554773', '2024-07-28 02:10:16.554773')
---
        <span class="text-muted ms-2" style="font-size: 0.85rem;">
          <%= l(comment.created_at, format: :short) %>

UPDATE `comments` SET `comments`.`body` = 'あｄｆｄ', `comments`.`updated_at` = '2024-07-28 02:06:15.312776' WHERE `comments`.`id` = 23
---
        <div class="d-flex justify-content-end">
          <%= form.submit t('comments.update'), class: 'btn btn-primary me-2' %>