app/views/recipes/_form.html.erb

SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 8 AND `recipe_kitchen_tools`.`id` = 4
---
      <% end %>
      <% if recipe.recipe_kitchen_tools.empty? %>