app/views/recipes/show.html.erb

SELECT `recipe_steps`.* FROM `recipe_steps` WHERE `recipe_steps`.`recipe_id` = 2
---
    <h3>調理工程</h3>
    <% @recipe.recipe_steps.each do |step| %>

SELECT `ingredients`.* FROM `ingredients` INNER JOIN `recipe_ingredients` ON `ingredients`.`id` = `recipe_ingredients`.`ingredient_id` WHERE `recipe_ingredients`.`recipe_id` = 2
---
    <ul>
      <% @recipe.ingredients.each do |ingredient| %>