app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.build(comment_params)
    @comment.user = current_user
    if @comment.save
---
INSERT INTO `comments` (`user_id`, `body`, `commentable_type`, `commentable_id`, `created_at`, `updated_at`) VALUES (2, 'あ', 'Recipe', 3, '2024-07-27 06:31:18.659865', '2024-07-27 06:31:18.659865')

  def update
    if @comment.update(comment_params)
---
UPDATE `comments` SET `comments`.`body` = 'ふぁｄさｓど', `comments`.`updated_at` = '2024-07-27 08:02:52.747107' WHERE `comments`.`id` = 12

  def destroy
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 11

  def set_commentable
    @commentable = if params[:recipe_id]
                     Recipe.find(params[:recipe_id])
                   elsif params[:foodstuff_id]
                     Foodstuff.find(params[:foodstuff_id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
SELECT `foodstuffs`.* FROM `foodstuffs` WHERE `foodstuffs`.`id` = 11 LIMIT 1