app/controllers/comments_controller.rb

  def set_commentable
    @commentable = if params[:recipe_id]
                     Recipe.find(params[:recipe_id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1