app/controllers/foodstuffs_controller.rb

  def index # /foodstuffs.json用
    @foodstuffs = Foodstuff.all
---
SELECT `foodstuffs`.* FROM `foodstuffs`

  def create
    @foodstuff = Foodstuff.new(foodstuff_params)
    @foodstuff.user = current_user

    respond_to do |format|
      if @foodstuff.save
---
INSERT INTO `foodstuffs` (`name`, `price`, `description`, `link`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('a', 100, 'a', 'a', 2, '2024-07-19 03:14:55.895389', '2024-07-19 03:14:55.895389', NULL)

  def destroy
    @foodstuff.destroy
---
DELETE FROM `foodstuffs` WHERE `foodstuffs`.`id` = 6

  def set_foodstuff
    @foodstuff = Foodstuff.find(params[:id])
---
SELECT `foodstuffs`.* FROM `foodstuffs` WHERE `foodstuffs`.`id` = 6 LIMIT 1