app/controllers/home_controller.rb

  def top
    if params[:query].present?
      query = params[:query]
      @recipes = Recipe.search(query, page: params[:page], per_page: 10).includes(:user_actions)
      @foodstuffs = Foodstuff.search(query, page: params[:page], per_page: 10).includes(:user_actions)
---
SELECT `recipes`.* FROM `recipes`
SELECT `foodstuffs`.* FROM `foodstuffs`