app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

  def new
    @recipe = Recipe.new
    @recipe.recipe_steps.build
    @recipe.recipe_ingredients.build
    @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?
---
SELECT `ingredients`.* FROM `ingredients`
SELECT `kitchen_tools`.* FROM `kitchen_tools`

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user

    if save_ingredients_and_kitchen_tools(@recipe) && @recipe.save
      redirect_to @recipe, notice: 'レシピが投稿されました。'
    else
      @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?
---
INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('白米', '2024-07-21 02:06:56.939887', '2024-07-21 02:06:56.939887')
INSERT INTO `recipe_kitchen_tools` (`recipe_id`, `kitchen_tool_id`, `created_at`, `updated_at`) VALUES (2, 1, '2024-07-27 04:02:58.291976', '2024-07-27 04:02:58.291976')
INSERT INTO `recipes` (`title`, `dish_image`, `user_id`, `created_at`, `updated_at`) VALUES ('123456', '0b157341-868b-4186-83f4-11555ef93177.jpg', 2, '2024-07-27 04:02:58.246886', '2024-07-27 04:02:58.246886')
SELECT `kitchen_tools`.* FROM `kitchen_tools`

  def edit
    @recipe.recipe_ingredients.each do |ri|
      ri.ingredient_name = ri.ingredient.name if ri.ingredient.present?
    end
    @recipe.recipe_kitchen_tools.each do |rkt|
      rkt.kitchen_tool_name = rkt.kitchen_tool.name if rkt.kitchen_tool.present?
    end
    @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?
---
SELECT `recipe_ingredients`.* FROM `recipe_ingredients` WHERE `recipe_ingredients`.`recipe_id` = 2
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 1 LIMIT 1
SELECT `recipe_ingredients`.* FROM `recipe_ingredients` WHERE `recipe_ingredients`.`recipe_id` = 1
SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 2
SELECT `recipe_ingredients`.* FROM `recipe_ingredients` WHERE `recipe_ingredients`.`recipe_id` = 8 AND `recipe_ingredients`.`id` = 10
SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 8 AND `recipe_kitchen_tools`.`id` = 4

  def update
    @recipe.assign_attributes(recipe_params)

    @recipe.recipe_steps.each do |step|
      step.mark_for_destruction if step._destroy == "1"
    end

    @recipe.recipe_kitchen_tools.each do |tool|
      tool.mark_for_destruction if tool._destroy == "1"
    end

    @recipe.recipe_ingredients.each do |ingredient|
      ingredient.mark_for_destruction if ingredient._destroy == "1"
    end

    if save_ingredients_and_kitchen_tools(@recipe) && @recipe.save
      redirect_to @recipe, notice: 'レシピが更新されました。'
    else
      @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?
---
SELECT `recipe_steps`.* FROM `recipe_steps` WHERE `recipe_steps`.`recipe_id` = 2
SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 2
SELECT `recipe_ingredients`.* FROM `recipe_ingredients` WHERE `recipe_ingredients`.`recipe_id` = 2
INSERT INTO `recipe_ingredients` (`recipe_id`, `ingredient_id`, `created_at`, `updated_at`) VALUES (7, 3, '2024-07-22 07:03:30.029182', '2024-07-22 07:03:30.029182')
UPDATE `recipe_ingredients` SET `recipe_ingredients`.`ingredient_id` = 3, `recipe_ingredients`.`updated_at` = '2024-07-22 07:06:02.867403' WHERE `recipe_ingredients`.`id` = 7
UPDATE `recipe_kitchen_tools` SET `recipe_kitchen_tools`.`kitchen_tool_id` = 5, `recipe_kitchen_tools`.`updated_at` = '2024-07-22 06:47:43.275827' WHERE `recipe_kitchen_tools`.`id` = 6
INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('白米', '2024-07-21 02:06:56.939887', '2024-07-21 02:06:56.939887')
SELECT `recipe_ingredients`.* FROM `recipe_ingredients` WHERE `recipe_ingredients`.`recipe_id` = 1
SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 1
SELECT `recipe_steps`.* FROM `recipe_steps` WHERE `recipe_steps`.`recipe_id` = 1

  def destroy
    @recipe.destroy
---
DELETE FROM `recipes` WHERE `recipes`.`id` = 5

  def set_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 2 LIMIT 1

  def save_ingredients(recipe)
    recipe.recipe_ingredients = recipe.recipe_ingredients.reject { |ri| ri.ingredient_name.blank? }
    recipe.recipe_ingredients.each do |ri|
      if ri.ingredient_name.present?
        ingredient = Ingredient.find_or_create_by(name: ri.ingredient_name)
---
SELECT `ingredients`.* FROM `ingredients` WHERE `ingredients`.`name` = '白米' LIMIT 1
INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('清酒', '2024-07-22 08:22:41.410084', '2024-07-22 08:22:41.410084')

  def save_kitchen_tools(recipe)
    recipe.recipe_kitchen_tools = recipe.recipe_kitchen_tools.reject { |rkt| rkt.kitchen_tool_name.blank? }
    recipe.recipe_kitchen_tools.each do |rkt|
      if rkt.kitchen_tool_name.present?
        kitchen_tool = KitchenTool.find_or_create_by(name: rkt.kitchen_tool_name)
---
SELECT `kitchen_tools`.* FROM `kitchen_tools` WHERE `kitchen_tools`.`name` = '炊飯器' LIMIT 1