app/controllers/recipes_controller.rb

INSERT INTO `recipe_kitchen_tools` (`recipe_id`, `kitchen_tool_id`, `created_at`, `updated_at`) VALUES (6, 5, '2024-07-22 06:45:33.158857', '2024-07-22 06:45:33.158857')
SELECT `ingredients`.* FROM `ingredients`
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user

    # デバッグ用ログ
    Rails.logger.info "Received recipe_params: #{recipe_params.inspect}"
    Rails.logger.info "Recipe Ingredients from params: #{params[:recipe][:recipe_ingredients_attributes].inspect}" if params[:recipe][:recipe_ingredients_attributes]
    Rails.logger.info "Recipe Kitchen Tools from params: #{params[:recipe][:recipe_kitchen_tools_attributes].inspect}" if params[:recipe][:recipe_kitchen_tools_attributes]

    respond_to do |format|
      if save_ingredients_and_kitchen_tools(@recipe) && @recipe.save
        format.html { redirect_to @recipe, notice: I18n.t('notices.recipe_created') }
        format.json { render :show, status: :created, location: @recipe }
      else
        # デバッグ: バリデーションエラーの内容を出力
        Rails.logger.info "Recipe save failed. Errors: #{@recipe.errors.full_messages}"
        Rails.logger.info "Recipe Ingredients after processing: #{@recipe.recipe_ingredients.inspect}"
        Rails.logger.info "Recipe Kitchen Tools after processing: #{@recipe.recipe_kitchen_tools.inspect}"

        @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?

INSERT INTO `kitchen_tools` (`name`, `created_at`, `updated_at`) VALUES ('炊飯器', '2024-07-21 02:06:56.962691', '2024-07-21 02:06:56.962691')
INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('塩', '2024-07-22 07:03:29.975297', '2024-07-22 07:03:29.975297')
SELECT `recipe_kitchen_tools`.* FROM `recipe_kitchen_tools` WHERE `recipe_kitchen_tools`.`recipe_id` = 3
---
  def update
    @recipe.assign_attributes(recipe_params)

    @recipe.recipe_steps.each do |step|
      step.mark_for_destruction if step._destroy == "1"
    end

    @recipe.recipe_kitchen_tools.each do |tool|
      tool.mark_for_destruction if tool._destroy == "1"
    end

    @recipe.recipe_ingredients.each do |ingredient|
      ingredient.mark_for_destruction if ingredient._destroy == "1"
    end

    respond_to do |format|
      if save_ingredients_and_kitchen_tools(@recipe) && @recipe.save
        format.html { redirect_to @recipe, notice: I18n.t('notices.recipe_updated') }
        format.json { render :show, status: :ok, location: @recipe }
      else
        @recipe.recipe_kitchen_tools.build if @recipe.recipe_kitchen_tools.empty?