app/controllers/user_actions_controller.rb

  def create
    Rails.logger.debug("params: #{params.inspect}")
    @action = current_user.user_actions.new(user_action_params)
    if @action.save
---
INSERT INTO `user_actions` (`user_id`, `action_type`, `actionable_type`, `actionable_id`, `created_at`, `updated_at`) VALUES (2, 'bookmark', 'Recipe', 4, '2024-08-02 08:03:24.604341', '2024-08-02 08:03:24.604341')

  def destroy
    @action = current_user.user_actions.find(params[:id])
    @action.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `user_actions`.* FROM `user_actions` WHERE `user_actions`.`user_id` = 2 AND `user_actions`.`id` = 1 LIMIT 1
DELETE FROM `user_actions` WHERE `user_actions`.`id` = 1